assets/schemas/xml/requestModel_1.2.xml

<?xml version="1.0" encoding="utf-8"?>
	<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	  <soap:Body>
	    <ConsultaCNPJRequest xmlns="http://www.prefeitura.sp.gov.br/nfe">
	      <VersaoSchema>1</VersaoSchema>
	      <MensagemXML><![CDATA[` + msgSigned + `]]></MensagemXML>
	    </ConsultaCNPJRequest>
	  </soap:Body>
	</soap:Envelope>